# St7SetSolverIncludeKG

Sets the state of the KG option for geometric nonlinear analysis.

long St7SetSolverIncludeKG(long uID, bool IncludeKG)
Input Parameters
uID
Strand7 model file ID.
IncludeKG
True to include the geometric stiffness matrix, KG.